In [60]:
import pandas as pd
import numpy as np

df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN',
'londON_StockhOlm','Budapest_PaRis', 'Brussels_londOn'],
'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )',
'12. Air France', '"Swiss Air"']})

In [61]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

# 1

In [62]:
df.FlightNumber=df.FlightNumber.fillna(0)

for i in range(len(df.FlightNumber)):
    if df.FlightNumber[i]==0:
        df.FlightNumber[i]=df.FlightNumber[i-1]+10
        
df.FlightNumber=df.FlightNumber.astype(int)   
print(df.FlightNumber.dtype)
df

int32

<ipython-input-62-e0ac3e134608>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.FlightNumber[i]=df.FlightNumber[i-1]+10

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

# 2

In [63]:
sep_values=df.From_To.str.split("_",expand=True)
sep_values.columns=["From","To"]
sep_values

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

# 3

In [64]:
sep_values.From=sep_values.From.str.capitalize()
sep_values.To=sep_values.To.str.capitalize()
sep_values

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

# 4

In [65]:
df.drop(labels="From_To",axis=1,inplace=True)
df=sep_values.join(df,how="outer")
df

       From         To  FlightNumber  RecentDelays              Airline
0    London      Paris         10045      [23, 47]               KLM(!)
1    Madrid      Milan         10055            []    <Air France> (12)
2    London  Stockholm         10065  [24, 43, 87]  (British Airways. )
3  Budapest      Paris         10075          [13]       12. Air France
4  Brussels     London         10085      [67, 32]          "Swiss Air"

# 5

In [66]:
b=len(df.RecentDelays[0])
for i in df.RecentDelays :
    if len(i)>b:
        b=len(i)
for i in range(b):
    q=[]
    for j in range(len(df.RecentDelays)): 
        if len(df.RecentDelays[j])==0:
            q.append(np.nan)
        if i>=len(df.RecentDelays[j]):
            q.append(np.nan)
            continue
        q.append(df.RecentDelays[j][i])
    q.pop(2)    
    print(q)
    df.insert(loc=3,value=q,column="Delay"+'{}'.format(i+1),allow_duplicates=True)

[23, nan, 24, 13, 67]
[47, nan, 43, nan, 32]
[nan, nan, 87, nan, nan]

In [67]:
df.drop(labels="RecentDelays",axis=1)
df

,From,To,FlightNumber,Delay3,Delay2,Delay1,RecentDelays,Airline
0,London,Paris,10045,NaN,47.0,23.0,"[23, 47]",KLM(!)
1,Madrid,Milan,10055,NaN,NaN,NaN,[],<Air France> (12)
2,London,Stockholm,10065,87.0,43.0,24.0,"[24, 43, 87]",(British Airways. )
3,Budapest,Paris,10075,NaN,NaN,13.0,[13],12. Air France
4,Brussels,London,10085,NaN,32.0,67.0,"[67, 32]","""Swiss Air"""